[{"content":"\rSo you enjoyed 50 Shades of Grey, The Claiming of Sleeping Beauty, and The Secretary a little more than you let on? You thought to yourself, I bet there’s more of this stuff out there. You browsed a bit and found kink, BDSM, and fetish websites by the dozen. You watched movies. You read stories. Maybe you even checked out a personal ad or two. Then you found us.\nPittsburgh Bridge is the gateway into the world you’ve been imagining. Are you ready to take the next step? Are you ready to meet others like you who are just beginning to explore this side of themselves? You’ve come to the right place. We offer a safe, friendly space to meet people who share your interests, classes that will help you learn things they don’t put in books, and everything else that you need to turn your fantasies into reality.\nYou can visit us on FetLife at: https://fetlife.com/groups/3115\nCome inside.\n","date":1681171200,"description":"","lastmod":"2023-04-11T00:00:00Z","objectID":"3976528693a0108357f4928017600865","permalink":"https://pittsburghbdsm.com/","title":"Pittsburgh Bridge"},{"content":"","date":1597276800,"description":"","lastmod":"2020-08-13T00:00:00Z","objectID":"b0d8ccffb8d530bff08365a148a04ee6","permalink":"https://pittsburghbdsm.com/blog/","publishdate":"2020-08-13T00:00:00Z","title":"Our Blog"},{"content":"Type of Event\rThe first thing to consider is the kind of social experience that will be comfortable for you, and help you feel encouraged about continuing to explore. Our various events provide different social experiences and atmospheres. It is helpful to select the type of event that best suits your personality.\nDo you want a large group setting in which you can see a good range of members of the local scene?\nThe Roland’s Munch on the first Tuesday of the month is where it’s at! This munch gathers 100+ local kinksters into all different kinds of play and from many different walks of life.\nThe munch at The Big Bang also brings in between 30 to 70 folks each month in a more intimately sized venue.\nDo you want a smaller social setting in which you can get a feel for a few people at a time?\nOn the second Tuesday of the month we offer an event for the under 35 age group: TNG Pittsburgh (35 and under). This makes for more low key events, and can be ideal for those who feel more comfortable with their age peers.\nHappy Hours and Sloshes are smaller high energy events with a rowdier atmosphere.\nBonus munches on the fifth Tuesday of month at various locations draw about 40 to 60 attendees.\nDo you want to learn from more experienced players?\nBridge has two education based events: Bridge Academy and The TNG Meeting. Some of the other local groups like Threshold, Ropebite, Hitchin Bitches also have instructional events.\nTiming\rIf you can, think about arriving right at the posted start time. It will allow you to acclimate to the venue, and have more focused conversations with the host and others without the sense of having to compete with as many others for their attention.\nWhat to Wear\rYou don’t need to dress up, but pick something in which you feel you look good. People show up in work clothes, dresses, jeans and t shirts, Sunday best, and everything in between.\nYou should only wear fetish, bondage gear, or extremely revealing clothing to parties. And even then, cover up …","date":1474502400,"description":"","lastmod":"2016-09-22T00:00:00Z","objectID":"cfaebac233976fe9d0be3accfafef988","permalink":"https://pittsburghbdsm.com/blog/advice/","publishdate":"2016-09-22T00:00:00Z","title":"Advice For Your First Event"},{"content":"One very common theme that I hear across many new attendees to our munches is an expression of anxiety or uncertainty about joining the community. I am commonly asked if it is appropriate for a new or curious person to just show up, or if it is acceptable to just walk up to others at the event and introduce yourself. The answer to both of those question is emphatically yes.\nOne of the primary purposes of our munches is to help others meet and connect with new friends. When you walk into Roland’s, James Street Pub, or any other of our events – remember that every person in that room has had to at some point or other come out to a community event for the first time. Nobody is going to demand your resume, qualifications, or references before they will to talk to you. We are all here to make friends, so as a new attendee keep in mind that the social interactions that you’re anxious about aren’t just acceptable, they’re literally the point.\nAnother common question that I hear is “What do people talk about? I’m brand new so I won’t really have anything to contribute to kink related discussions.” This, too, is perfectly okay! While it is quite normal for newer folks to simply ask questions and learn from others about their areas of interest, many other new attendees aren’t comfortable walking in the door and divulging their fantasies and desires to strangers. If that’s the case, please come anyway! Pittsburgh Bridge is a non-judgmental, open community for a diverse swath of alternative lifestyles – and if this sounds like an environment that is desirable to you, there’s no requirement to take the discussion about your own sexuality any further.\nIn fact, take a walk around our munches on a busy night and you will hear discussions about upcoming movies, television, theater, hair styles, the most desirable breed of dog, which local bar makes their drinks the strongest, iPhone vs. Android, upcoming concerts, The Pittsburgh Penguins, video games, and everything else under the …","date":1470268800,"description":"","lastmod":"2016-08-04T00:00:00Z","objectID":"bddad610eb94112ab812fd08432a8e2d","permalink":"https://pittsburghbdsm.com/blog/not-scary/","publishdate":"2016-08-04T00:00:00Z","title":"The BDSM Community - It's Not That Scary After All"},{"content":"A New Look\rWe are excited to launch our redesigned website - complete with the new logo, color scheme, and running on a new platform under the hood! This new look symbolizes our rebirth after several long years in hibernation running primarily virtual events.\nAs Twitter seems to be a less and less reliable platform, you can look to this website for more regular updates and event information!\nBridge Reemurges from the Pandemic Hiatus\rWith our Roland\u0026amp;rsquo;s Munch now consistently in full swing, we are looking to get more events back to a regular cadence. We promise some exciting announcements coming up in the near future following up on the big news of the return of the Pittsburgh Community Kinknic (Fetlife Link, login required).\nUnfortunately not all of our venues survived the pandemic, so we are still in the process of evaluating what is and isn\u0026amp;rsquo;t feasible for regular events. But stay tuned for more exciting news as we get continue our mission to get back in the full swing of events!\n","date":1681171200,"description":"","lastmod":"2023-04-11T00:00:00Z","objectID":"975e74dc5318a05b6a467121d224fab0","permalink":"https://pittsburghbdsm.com/blog/website2/","publishdate":"2023-04-11T00:00:00Z","title":"New Website Launch / End of Pandemic Hiatus"},{"content":"\r","date":1597276800,"description":"","lastmod":"2020-08-13T00:00:00Z","objectID":"a631103cf606bbead447236a29c6889e","permalink":"https://pittsburghbdsm.com/calendar/","publishdate":"2020-08-13T00:00:00Z","title":"Community Calendar"},{"content":"\rLooking for a place to start? See our welcome and about us pages first!\n","date":1597276800,"description":"","lastmod":"2020-08-13T00:00:00Z","objectID":"29b19ec17cdfc336525c60da2c8becff","permalink":"https://pittsburghbdsm.com/group-info/","publishdate":"2020-08-13T00:00:00Z","title":"Group Information"},{"content":"Pittsburgh Bridge is a BDSM peer group primarily designed to provide social interaction and education to people interested in a variety of alternative lifestyles. Pittsburgh Bridge welcomes everyone 18 years of age or older regardless of experience level, providing you are accepting and respectful of all of our members.\nOur mission is to create and foster a supportive and enriching environment comprised of mutual respect, acceptance, fluid communication, honesty, and exploration without judgment as we pursue our passions, needs, desires, and enjoyment with regards to BDSM. We do so while fueling our creativity and inquisitive natures, as well as developing peer kinships and establishing strong roots within our local kink community.\nIn addition to these values, our focus is to promote education using the tenets of SSC and RACK, personal growth, and community cohesion.\nAccountability and personal responsibility are essential to achieving this mission, and it is vital that each of us is the embodiment of these qualities. For the betterment of the Pittsburgh community, we hold ourselves to these high standards, so that each and every one of us is an exceptional representative of the whole.\n","date":1597276800,"description":"","lastmod":"2020-08-13T00:00:00Z","objectID":"baf43a56bc6db8433ef7afeb597dd926","permalink":"https://pittsburghbdsm.com/group-info/about/","publishdate":"2020-08-13T00:00:00Z","title":"About Us"},{"content":"Munches\rMunches are social gatherings, which are generally held at restaurants. These are weeknight events which center around food, drink, and discussion with fellow kinksters. They offer a relaxed atmosphere and are an excellent way to meet people and begin to explore kink.\nHappy Hour\rIf you’re not quite ready for a play event, but looking for something a little wilder than a munch, Happy Hours are the events for you. They’re held at a selection of bars across the city and generally include drinks, dancing, and a party atmosphere.\nEducational Events\rAcademy events are educational classes which focus on a variety of topics across the spectrum of kink. Speakers may include experienced members of the local community or nationally known presenters, and the presentation typically includes a live demonstration which illustrates the concepts being taught.\nFind out about upcoming events on our calendar page!\n","date":1597276800,"description":"","lastmod":"2020-08-13T00:00:00Z","objectID":"f20058c0c8bfcbff984d4e91adb2bb44","permalink":"https://pittsburghbdsm.com/group-info/bridge-events/","publishdate":"2020-08-13T00:00:00Z","title":"Bridge Events"},{"content":"Bridge offers three kinds of educational classes that focus on a variety of topics across the spectrum of kink.\nBridge Academy\rGenerally on a Saturday from 2-4, some topics run longer. These classes are in depth looks on a variety of different topics. Classes can be structured as demonstrations, lectures, discussions, or hands-on workshops. They cover content on kink dynamics and technical skills of play.\nMore information on our events coming soon as we get in full swing from the pandemic.\n","date":1597276800,"description":"","lastmod":"2020-08-13T00:00:00Z","objectID":"c438e01705e5c7568b668194016dc5e9","permalink":"https://pittsburghbdsm.com/group-info/bridge-events/education/","publishdate":"2020-08-13T00:00:00Z","title":"Education"},{"content":"If you’re not quite ready for a play event, but looking for something a little wilder than a munch, Happy Hours are the events for you. They’re held at a selection of bars across the city and generally include drinks, dancing, and a party atmosphere. Pittsburgh Bridge Happy Hour is held at 7 p.m. on the second or third Friday of the month at various bars around the city.\nPittsburgh Bridge is currently reevaluating our Happy Hour locations as we recover from the pandemic.\n","date":1597276800,"description":"","lastmod":"2020-08-13T00:00:00Z","objectID":"ade98583590b926b5a810fc22bb94f33","permalink":"https://pittsburghbdsm.com/group-info/bridge-events/happy-hour/","publishdate":"2020-08-13T00:00:00Z","title":"Happy Hour"},{"content":"Munches are social gatherings, which are generally held at restaurants. These are weeknight events which center around food, drink, and discussion with fellow kinksters. They offer a relaxed atmosphere and are an excellent way to meet people and begin to explore kink.\nPittsburgh Bridge Munch: Roland’s\r7 p.m. on the first Tuesday of the month at Roland’s Seafood Grill in the Strip District.\nRoland’s is one of our favorite venues. It offers a large, private area upstairs with a deck, pool tables, a huge bar, a lounge, and all the space we need to stretch out. Downstairs, where This Generation Pittsburgh is held, is a smaller, comfortable space with a cozy fireplace. Summer or winter, Roland’s is a fantastic place to enjoy an evening with friends.\nMore munches returning soon!\n","date":1597276800,"description":"","lastmod":"2020-08-13T00:00:00Z","objectID":"de56bd6d0769c1af04d3b8a1933d896c","permalink":"https://pittsburghbdsm.com/group-info/bridge-events/munches/","publishdate":"2020-08-13T00:00:00Z","title":"Munches"},{"content":"By attending Bridge events or making use of Bridge resources, individuals agree to adhere to the following guidelines:\nTreat other attendees with respect and courtesy. Anyone engaging in rude or disruptive behavior will be warned. If the behavior continues, the person may be asked to leave and not attend further Pittsburgh Bridge events.\nMost Bridge events are held in public restaurants. These venues welcome the kink community, but there are acceptable levels of dress and behavior that we must maintain. Fetish and sexy clothing is welcome and encouraged, but because these are public venues, it is not acceptable to expose more than would be allowed in any other public place.\nAlthough many of our events take place at venues that serve alcohol, engaging in or negotiating play while intoxicated is strongly discouraged.\nPittsburgh Bridge wishes to create the safest possible environment for the attendees of our events. As such, we take sexual assault and other major consent violations very seriously. Anyone credibly accused of such a violation may be asked not to attend events organized by Pittsburgh Bridge. When these issues arise, Bridge generally adheres to the NCSF Best Practices for Consent to Kink.\nIt is much better for everyone, however, if these incidents never happen in the first place, so we also support prevention activities including education in consent and safety. Even in the presence of these measures, attendees should understand that no environment is completely safe and that they are ultimately responsible for their own well being.\n","date":1597276800,"description":"","lastmod":"2020-08-13T00:00:00Z","objectID":"b385a29b192bb278f9ba9613b7b5a8b8","permalink":"https://pittsburghbdsm.com/group-info/guidelines/","publishdate":"2020-08-13T00:00:00Z","title":"Guidelines for Conduct"},{"content":"National Coalition for Sexual Freedom\rThe NCSF is committed to creating a political, legal and social environment in the US that advances equal rights for consenting adults who engage in alternative sexual and relationship expressions. The NCSF aims to advance the rights of, and advocate for consenting adults in the BDSM-Leather-Fetish, Swing, and Polyamory Communities. We pursue our vision through direct services, education, advocacy, and outreach, in conjunction with our partners, to directly benefit these communities.\nThe Kink And Poly Aware Professionals Directory (KAP) is a service offered by NCSF dedicated to providing the community with a listing of psychotherapeutic, medical, legal and other professionals who have stated that they are knowledgeable about and sensitive to diverse expressions of sexuality.\nIntroductory Writings\rThese writings were put together by experienced kinkster and member of our leadership team roo-roo. They cover common topics that are of particular interest to newcomers in our community.\nGetting into the BDSM Community, available as a Fetlife link or as a PDF download.\nSafety in the Scene, available as Fetlife link or as a PDF download.\nFrequently Asked Questions on bdsm, munches, and local events, available as Fetlife link or as a PDF download.\nFinding a Partner in the BDSM Community, available as Fetlife link or as a PDF download.\n","date":1597276800,"description":"","lastmod":"2020-08-13T00:00:00Z","objectID":"abb7428078bd28075f6bd7e89f6156eb","permalink":"https://pittsburghbdsm.com/group-info/resources/","publishdate":"2020-08-13T00:00:00Z","title":"Resources"},{"content":"TNG is a group under the Bridge umbrella focused on the needs of the 18-35 age demographic (and their partners) of our community. We welcome all sexualities and gender identification, and any D/s or M/s or any variant power exchange dynamic. As a group we will strive to maintain a safe, respectful, supportive and educational environment for the youngest members of our Pittsburgh Kink community, to further the education and safety of our community as a whole.\nWe will provide an open forum (on Fetlife, this website and primarily in real life) for our members to discuss relevant topics in regards to alternative sexuality, relationships, general BDSM, events and safety within the active community. As well as any other topic that may pertain to being 18 to 35 in this community.\nWe meet twice per month. Our educational meeting is on the second Tuesday and held at The Equality Center in downtown Pittsburgh. Every second Tuesday we have a different presentation or discussion; past topics have included scene etiquette, role play, erotic hypnosis, and tickling.\nOur sloshes are usually held on the last Friday of the month and rotate between various bars and restaurants.\nAny questions? You can contact us at: TNGPittsburgh@gmail.com\nTNG will return soon as we work on recovering from the pandemic!\n","date":1597276800,"description":"","lastmod":"2020-08-13T00:00:00Z","objectID":"2885578ebc415e21ee388b1322ab9009","permalink":"https://pittsburghbdsm.com/group-info/tng/","publishdate":"2020-08-13T00:00:00Z","title":"The Next Generation"},{"content":"Sloshes are booze-centric shindigs. Drink, eat, and be merry in a low key social environment. It’s a bit wilder than a munch, but not quite as intense as a happy hour. You could consider it a cross between the two. Sloshes are designed for those in the 18-35 age demographic (and their partners) to have a relaxed atmosphere to connect with others and begin to explore kink.\nTNG sloshes are usually held on the last Friday of the month and rotate between various bars and restaurants.\n","date":1597276800,"description":"","lastmod":"2020-08-13T00:00:00Z","objectID":"7653edf382f10d87e275d9d6080858b9","permalink":"https://pittsburghbdsm.com/group-info/tng/sloshes/","publishdate":"2020-08-13T00:00:00Z","title":"Sloshes"},{"content":"Tweets by PghBridge ","date":1597276800,"description":"","lastmod":"2020-08-13T00:00:00Z","objectID":"cce2363f2ffe83196d44b00404878af5","permalink":"https://pittsburghbdsm.com/twitter/","publishdate":"2020-08-13T00:00:00Z","title":"Twitter Feed"}]